brew 'arping'
brew 'awscli'
brew 'balenaetcher'
brew 'docker-compose'
brew 'elixir'
brew 'go'
brew 'pass'
brew 'ruby'
brew 'speedtest_cli'
brew 'swiftlint'

cask 'font-cascadia'
cask 'font-fira-code'
cask 'font-ibm-plex'

cask 'arq'
cask 'arq-cloud-backup'
cask 'battle-net'
cask 'backblaze'
cask 'deezer'
cask 'docker'
cask 'flume'
cask 'julia'
cask 'soda-player'
cask 'xit'
cask 'homebrew/cask-drivers/logitech-myharmony'
cask 'logitech-options'
cask 'macupdate'
cask 'microsoft-teams'
cask 'kindlegen'
cask 'powershell'
cask 'qtpass'
cask 'racket'
cask 'signal'
cask 'slack'
cask 'sequel-pro'
cask 'lastfm' 
cask 'ledger-live'

mas 494803304  # WiFi Explorer
mas 455970963  # Disk Doctor (3.6)
mas 686428787  # Duplicate Detective
mas 1142151959 # JustFocus (1.3.3)
mas 511114225  # MetaMovie
mas 624884154  # Lingo (2.0.5)

