cask_args appdir: '/Applications'

## Install Plan 9 Applications

brew 'rc'

## Install Core Rust Applications

brew 'lsd'
brew 'ox'

## Install Homebrew Applications

brew 'ansible'
brew 'archey'
brew 'bash'
brew 'bbcolors'
brew 'bit-git'
brew 'broot'
brew 'busycal'
brew 'caddy'
brew 'carthage'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'docker-compose'
brew 'muesli/homebrew-tap/duf'
brew 'fdupes'
brew 'fish'
brew 'fzy'
brew 'git'
brew 'glow'
brew 'gnu-tar'
brew 'gpg-tui'
brew 'hugo'
brew 'httpie'
brew 'libyaml'
brew 'lsusb'
brew 'mdbook'
brew 'mas'
brew 'ubuntu/microk8s/microk8s'
brew 'mosh'
brew 'nano'
brew 'navi'
brew 'neofetch'
brew 'netlify-cli'
brew 'ncdu'
brew 'nnn'
brew 'nmap'
brew 'openssl'
brew 'osx-cpu-temp'
brew 'pastel'
brew 'p7zip'
brew 'packer'
brew 'pandoc'
brew 'procs'
brew 'proselint'
brew 'pstree'
brew 'pv'
brew 'pwgen'
brew 'ranger'
brew 'restic'
brew 'rmlint'
brew 'sk'
brew 'shellcheck'
brew 'speedtest-cli'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'svn'
brew 'terraform'
brew 'testdisk'
brew 'tldr'
brew 'tree'
brew 'vcsh'
brew 'wget'
brew 'youtube-dl'
brew 'zola'

## Install Programming Languages Brews

brew 'newlisp'
brew 'rust'

## Install Programming Language Casks

## Install Homebrew Fonts

cask 'font-hack'
cask 'font-open-sans'
cask 'font-victor-mono'
cask 'font-ibm-plex'
cask 'font-fantasque-sans-mono'
cask 'font-ia-writer-duo'
cask 'font-ia-writer-duospace'
cask 'font-ia-writer-mono'
cask 'font-ia-writer-quattro'

## Install Rust Tools

brew 'bat'
cask 'bandwhich'
brew 'clementtsang/bottom/bottom'
brew 'dog'
brew 'dust'
brew 'exa'
brew 'fd'
brew 'grex'
brew 'hyperfine'
brew 'ripgrep'
brew 'sd'
cask 'tealdeer'
brew 'zenith'

## Install Color Apps

cask 'homebrew/cask/sip'
cask 'homebrew/cask/couleurs'

## Install Homebrew Cask Applications

cask '1password'
cask 'airbuddy'
cask 'alfred'
#cask 'archipelago'
cask 'battle-net'
cask 'bbedit'
cask 'beeper'
#cask 'beekeeper-studio'
#cask 'brave-browser'
cask 'burn'
cask 'caffeine'
cask 'cakebrew'
cask 'carbon-copy-cloner'
cask 'coderunner'
cask 'cog'
#cask 'cool-retro-term'
cask 'customshortcuts'
cask 'daisydisk'
cask 'dash'
#cask 'day-o'
cask 'devonthink'
cask 'devonagent'
cask 'discord'
#cask 'drivethrurpg'
#cask 'docker'
cask 'dosbox-x'
cask 'electrum'
cask 'epic-games'
#cask 'eul'
cask 'fantastical'
cask 'firefox'
#cask 'firefox-nightly'
cask 'fliqlo'
#cask 'foobar2000'
cask 'forklift'
cask 'fs-uae'
cask 'gog-galaxy'
cask 'gpg-suite'
cask 'gzdoom'
#cask 'handbrake'
cask 'homebrew/cask-versions/openemu-experimental'
cask 'houdahspot'
cask 'iina'
cask 'imageoptim'
#cask 'iStumbler'
cask 'iterm2'
cask 'kindle'
#cask 'kitematic'
#cask 'keybase'
cask 'kode54-cog'
#cask 'liteicon'
cask 'logitech-options'
cask 'mactracker'
cask 'macupdater'
#cask 'makemkv'
cask 'masscode'
cask 'mdimagesizemdimporter'
cask 'monolingual'
#cask 'homebrew/cask/mpv'
cask 'multipass'
#cask 'musaicfm'
#cask 'muzzle'
cask 'namechanger'
cask 'notion'
cask 'numi'
#cask 'obsidian'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omnioutliner'
#cask 'openemu'
cask 'open-in-code'
cask 'pictogram'
cask 'pika'
#cask 'plex-media-player'
cask 'pomotroid'
#cask 'postbox'
#cask 'powershell'
cask 'qlimagesize'
#cask 'rcse'
cask 'recents'
cask 'rectangle'
cask 'scrivener'
#cask 'secretive'
#cask 'signal-beta'
#cask 'silentknight'
#cask 'sonos'
cask 'soundsource'
cask 'sourcetree'
#cask 'speedcrunch'
cask 'spitfire-audio'
cask 'steam'
#cask 'syntax-highlight'
#cask 'swiftbar'
cask 'telegram'
cask 'textual'
#cask 'tiny-player'
cask 'the-unarchiver'
#cask 'touchswitcher'
cask 'unexpectedly'
cask 'visual-studio-code-insiders'
cask 'vmware-fusion'
cask 'xee'
#cask 'xbar'
cask 'xld'
cask 'yippy'
cask 'yubico-yubikey-manager'
#cask 'youtubedr'
cask 'vamiga'
#cask 'zandronum'
