brew 'arping'
brew 'awscli'
brew 'balenaetcher'
brew 'docker-compose'
brew 'elixir'
brew 'go'
brew 'pass'
brew 'ruby'
brew 'speedtest_cli'
brew 'swiftlint'

cask 'font-cascadia'
cask 'font-fira-code'
cask 'font-ibm-plex'

cask 'arq'
cask 'arq-cloud-backup'
cask 'battle-net'
cask 'backblaze'
cask 'deezer'
cask 'docker'
cask 'flume'
cask 'julia'
cask 'soda-player'
cask 'xit'
cask 'homebrew/cask-drivers/logitech-myharmony'
cask 'logitech-options'
cask 'malwarebytes'
cask 'macupdate'
cask 'microsoft-teams'
cask 'kindlegen'
cask 'powershell'
cask 'qtpass'
cask 'racket'
cask 'signal'
cask 'slack'
cask 'sequel-pro'
cask 'lastfm' 
cask 'ledger-live'
cask 'ableton-live-lite'
cask 'amethyst'
cask 'fing'
cask 'fing-cli'
cask 'gswitch'
cask 'itsycal'
cask 'keepingyouawake'
cask 'maccy'
cask 'menubar-countdown'
cask 'midikeys'
cask 'milkytracker'
cask 'mullvadvpn'
cask 'native-access'
cask 'nisus-thesaurus'
cask 'openinterminal-lite'
cask 'plex-media-player'
cask 'powershell'
cask 'switchhosts'
cask 'therm'
cask 'thorium'
cask 'xquartz'
cask 'turbo-boost-switcher'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vagrant-vmware-utility'
cask 'transmission'
cask 'unpkg'
cask 'vox'
cask 'vox-preferences-pane'
cask 'visual-studio-code'


mas 494803304  # WiFi Explorer
mas 455970963  # Disk Doctor (3.6)
mas 686428787  # Duplicate Detective
mas 1142151959 # JustFocus (1.3.3)
mas 511114225  # MetaMovie
mas 624884154  # Lingo (2.0.5)

