cask_args appdir: '/Applications'

## Install Homebrew Applications

brew 'ansible'
brew 'bash'
brew 'bat'
brew 'caddy'
brew 'carthage'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'docker-compose'
brew 'muesli/homebrew-tap/duf'
brew 'exa'
brew 'fd'
brew 'fdupes'
brew 'fish'
brew 'fzy'
brew 'git'
brew 'glow'
brew 'gnu-tar'
brew 'hugo'
brew 'httpie'
brew 'hyperfine'
brew 'libyaml'
brew 'lsusb'
brew 'mdbook'
brew 'mas'
brew 'ubuntu/microk8s/microk8s'
brew 'mosh'
brew 'navi'
brew 'neofetch'
brew 'ncdu'
brew 'nnn'
brew 'nmap'
brew 'openssl'
brew 'pastel'
brew 'p7zip'
brew 'packer'
brew 'pandoc'
brew 'procs'
brew 'proselint'
brew 'pv'
brew 'pwgen'
brew 'restic'
brew 'ripgrep'
brew 'rmlint'
brew 'sd'
brew 'sk'
brew 'shellcheck'
brew 'speedtest'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terraform'
brew 'testdisk'
brew 'tldr'
brew 'tree'
brew 'vcsh'
brew 'wget'
brew 'youtube-dl'
brew 'zola'

## Install Programming Languages Brews

brew 'newlisp'
brew 'rust'

## Install Programming Language Casks

## Install Homebrew Fonts

cask 'font-hack'
cask 'font-open-sans'

## Install Homebrew Cask Applications

cask '1password'
#cask 'ableton-live-lite'
cask 'alfred'
#cask 'amethyst'
cask 'bbedit'
cask 'beekeeper-studio'
#cask 'brave-browser'
cask 'cakebrew'
cask 'carbon-copy-cloner'
cask 'coderunner'
cask 'customshortcuts'
#cask 'dash'
cask 'day-o'
cask 'devonthink'
cask 'discord'
cask 'drivethrurpg'
#cask 'docker'
cask 'electrum'
cask 'epic-games'
cask 'fing'
cask 'fing-cli'
cask 'firefox'
cask 'forklift'
cask 'fs-uae'
cask 'gog-galaxy'
cask 'gpg-suite'
#cask 'gswitch'
cask 'gzdoom'
cask 'handbrake'
cask 'homebrew/cask-versions/openemu-experimental'
cask 'houdahspot'
cask 'iina'
cask 'imageoptim'
#cask 'iStumbler'
cask 'iterm2'
cask 'itsycal'
#cask 'keepingyouawake'
cask 'kindle'
#cask 'kitematic'
#cask 'keybase'
cask 'kode54-cog'
cask 'liteicon'
cask 'logitech-options'
#cask 'maccy'
cask 'mactracker'
cask 'macupdater'
cask 'makemkv'
cask 'menubar-countdown'
cask 'midikeys'
cask 'milkytracker'
cask 'monolingual'
cask 'multipass'
cask 'mullvadvpn'
cask 'musaicfm'
cask 'muzzle'
cask 'namechanger'
cask 'native-access'
#cask 'nisus-thesaurus'
cask 'notion'
cask 'numi'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omnioutliner'
#cask 'openemu'
cask 'openinterminal-lite'
cask 'plex-media-player'
cask 'pomotroid'
#cask 'powershell'
cask 'rectangle'
cask 'scrivener'
cask 'secretive'
cask 'silentknight'
cask 'sonos'
cask 'soundsource'
cask 'sourcetree'
cask 'steam'
#cask 'switchhosts'
cask 'telegram'
cask 'textual'
#cask 'therm'
cask 'the-unarchiver'
cask 'thorium'
cask 'transmission'
cask 'turbo-boost-switcher'
cask 'unpkg'
#cask 'vagrant'
#cask 'vagrant-manager'
#cask 'vagrant-vmware-utility'
cask 'vmware-fusion'
cask 'visual-studio-code'
cask 'xld'
cask 'xquartz'
