ansible
bash
brew-cask
cmake
colordiff
coreutils
ddrescue
fish
git
go
hugo
jrnl
libyaml
mono
newlisp
nmap
openssl
sqlite
ssh-copy-id
testdisk
transmission
tree
wget
whereami
zsh
