cask_args appdir: '/Applications'

## Install Homebrew Applications

brew 'ansible'
brew 'bash'
brew 'bat'
brew 'bluetoothconnector'
brew 'caddy'
brew 'carthage'
brew 'cmake'
brew 'colordiff'
brew 'coreutils'
brew 'darksky-weather'
brew 'docker-compose'
brew 'exa'
brew 'fd'
brew 'fdupes'
brew 'fish'
brew 'fs-uae' 
brew 'fzy'
brew 'git'
brew 'gnu-tar'
brew 'hugo'
brew 'httpie'
brew 'libyaml'
brew 'mas'
brew 'mosh'
brew 'navi'
brew 'neofetch'
brew 'ncdu'
brew 'nnn'
brew 'nmap'
brew 'openssl'
brew 'p7zip'
brew 'packer'
brew 'pandoc'
brew 'proselint'
brew 'pv'
brew 'pwgen'
brew 'restic'
brew 'rmlint'
brew 'shellcheck'
brew 'speedtest'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'terraform'
brew 'testdisk'
brew 'tldr'
brew 'tree'
brew 'vcsh'
brew 'wget'
brew 'youtube-dl'
brew 'zola'

## Install Programming Languages Brews

brew 'newlisp'
brew 'rust'

## Install Programming Language Casks

## Install Homebrew Fonts

cask 'font-hack'
cask 'font-open-sans'

## Install Homebrew Cask Applications

cask '1password'
cask 'alfred'
cask 'bbedit'
cask 'blackhole'
cask 'brave-browser'
cask 'cakebrew'
cask 'carbon-copy-cloner'
cask 'caprine'
cask 'coderunner'
cask 'dash'
cask 'day-o'
cask 'devonthink'
cask 'discord'
#cask 'docker'
cask 'electrum'
cask 'epic-games'
cask 'firefox'
cask 'forklift'
cask 'gog-galaxy'
cask 'gpg-suite'
cask 'gzdoom'
cask 'handbrake'
cask 'houdahspot'
cask 'iina'
cask 'imageoptim'
cask 'iterm2'
cask 'kindle'
cask 'kitematic'
cask 'keybase'
cask 'kode54-cog'
cask 'liteicon'
cask 'logitech-options'
cask 'makemkv'
cask 'mark-text'
cask 'monolingual'
cask 'multipass'
cask 'namechanger'
cask 'nisus-thesaurus'
cask 'notion'
cask 'numi'
cask 'omnifocus'
cask 'omnigraffle'
cask 'omnioutliner'
cask 'openemu'
cask 'openinterminal-lite'
cask 'plex-media-player'
cask 'powershell'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'rectangle'
cask 'scrivener'
cask 'softmaker-freeoffice'
cask 'sonos'
cask 'soundsource'
cask 'sourcetree'
cask 'steam'
cask 'telegram'
cask 'textual'
cask 'the-unarchiver'
cask 'transmission'
cask 'typora'
cask 'vagrant'
cask 'vagrant-manager'
cask 'vagrant-vmware-utility'
cask 'vmware-fusion'
cask 'vscodium'
cask 'xee'
cask 'xld'
cask 'xquartz'
